Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: The number of logical reads that InnoDB could not satisfy from buffer pool and had to do a single-page read.
sv: Antalet logiska läsningar som InnoDB inte kunde uppfylla från buffert och fick göra en enkelsidig läsning.

source: Create composite index
sv: Skapa sammansatta index

source: Edit partitioning
sv: Redigera partitionering

source: Session not found.
sv: Sessionen hittades inte.

source: Original position
sv: Ursprunglig position

source: Overwrite existing file(s)
sv: Skriv över befintlig(a) fil(er)

source: No index defined!
sv: Inga index är definierade!

source: No user found.
sv: Ingen användare hittades.

source: VIEW name
sv: VIEW-namn

source: Bookmark not created!
sv: Bokmärke ej skapat!

source: Current server:
sv: Aktuell Server:

source: This server is not configured as a primary server in a replication process. You can choose from either replicating all databases and ignoring some of them (useful if you want to replicate a majority of the databases) or you can choose to ignore all databases by default and allow only certain databases to be replicated. Please select the mode:
sv: Den här servern är inte konfigurerad som primärserver i en replikeringsprocess. Du kan antingen replikera alla databaser och ignorera vissa (användbart om du vill replikera flertalet databaser), eller ignorera alla databaser som standard och endast tillåta att vissa databaser replikeras. Välj läge:

source: Hour
sv: Timmar

source: Displays an image and a link; the column contains the filename. The first option is a URL prefix like "https://www.example.com/". The second and third options are the width and the height in pixels.
sv: Visar en bild och en länk; kolumnen innehåller filnamn. Det första alternativet är ett URL-prefix som "https://www.example.com/". Det andra och tredje alternativet är bredden och höjden i pixlar.

source: Step 3.
sv: Steg 3.

source: Showing rows %1s - %2s
sv: Visar raderna %1s - %2s

source: Server-level tabs
sv: Flikar på servernivå

source: Enter the request parameter used by your reCAPTCHA v2 compatible API.
sv: Ange begärandeparametern som används av ditt reCAPTCHA v2-kompatibla API.

source: Any
sv: Vem som helst

source: Length/Value
sv: Längd/värde

source: Error reading structure for table %s:
sv: Fel vid läsning av strukturen för tabellen %s:

source: Romanian
sv: Rumänsk

source: Column selector
sv: Kolumnväljaren

source: possible exploit
sv: möjlig exploatering

source: Not a non-negative number!
sv: Inte ett icke-negativt tal!

source: This server is configured as primary in a replication process.
sv: Den här servern är konfigurerad som primär i en replikeringsprocess.

source: Customize appearance of the navigation panel.
sv: Anpassa navigationspanelens utseende.

source: Provides authentication using hardware security tokens supporting the WebAuthn/FIDO2 protocol, such as a YubiKey.
sv: Tillhandahåller autentisering med maskinvarusäkerhetstoken som har stöd för WebAuthn/FIDO2-protokollet, till exempel en YubiKey.

source: Your memory capacity is above 3 GiB (assuming the Server is on localhost), so MySQL might not be able to access all of your memory. You might want to consider installing the 64-bit version of MySQL.
sv: Din minneskapacitet är över 3 GiB (förutsatt att servern är på localhost), så MySQL kanske inte kan att få tillgång till allt minne. Du kan vilja överväga att installera 64-bitars versionen av MySQL.

source: Primary key added.
sv: En primär nyckel har lagts till för %s.

source: Use this column in criteria
sv: Använd den här kolumnen i kriterier

source: A synonym for TINYINT(1), a value of zero is considered false, nonzero values are considered true
sv: En synonym för TINYINT (1), ett värde på noll betraktas som falskt, värden skilda från noll anses sanna

source: Select "%s"
sv: Välj ”%s”

source: Storage engines
sv: Lagringsmotorer

source: Modifications have been saved
sv: Ändringarna har sparats

source: Couldn't remove Column(s) %1$s as they don't exist in central columns list!
sv: Det gick inte att ta bort kolumn/er %1$s eftersom de inte finns i huvudförteckning kolumner!

source: URL where logo in the navigation panel will point to.
sv: URL som navigationspanelens logotyp pekar mot.

source: The size of a transaction log before rollover, and a new log is created. The default value is 16MB.
sv: Storleken på en transaktionslogg före övergång då en ny logg skapas. Standardvärdet är 16MB.

source: Relationship operator
sv: Relationsoperator

source: Navigation panel width
sv: Navigationspanelens bredd

source: Favorites table
sv: Favorittabeller

source: Requires that a valid X509 certificate with this subject be presented.
sv: Kräver att ett giltigt X509-certifikat presenteras.

source: Request aborted!!
sv: Begäran avbröts!

source: Increasing {max_heap_table_size} and {tmp_table_size} might help. However some temporary tables are always being written to disk, independent of the value of these variables. To eliminate these you will have to rewrite your queries to avoid those conditions (Within a temporary table: Presence of a BLOB or TEXT column or presence of a column bigger than 512 bytes) as mentioned in the beginning of an <a href="https://www.facebook.com/note.php?note_id=10150111255065841&comments">Article by the Pythian Group</a>
sv: Att öka {max_heap_table_size:} och {tmp_table_size:} kan hjälpa. Men vissa temporära tabeller skrivs alltid till disk, oberoende av värdet på dessa variabler. För att eliminera dessa måste du skriva om dina frågor för att undvika dessa villkor (Inom en temporär tabell: Förekomst av en BLOB- eller TEXT-kolumn eller förekomsten av en kolumn större än 512 byte) som nämns i början av en artikel av Pythian group: <a href="https://www.facebook.com/note.php?note_id=10150111255065841&comments">

source: An 8-byte integer, signed range is -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, unsigned range is 0 to 18,446,744,073,709,551,615
sv: Ett 8-bytes heltal, signerat inom intervallet -9.223.372.036.854.775.808 till 9.223.372.036.854.775.807, osignerat inom intervallet 0 till 18.446.744.073.709.551.615

source: Display columns table
sv: Visa tabellkolumner

source: Invalid format of mediawiki input on line: <br>%s.
sv: Ogiltigt format på mediawiki-data på rad:<br>%s.

source: Old MySQL-4.0 authentication
sv: Gammal MySQL-4.0-autentisering

source: Since grouping of INSERTs queries has been selected, INSERT queries into the same table are also being grouped together, disregarding of the inserted data.
sv: Sedan gruppering av INSERT-frågor har valts, är INSERT-frågor till samma tabell också grupperade tillsammans, oberoende av det data som infogats.

source: SQL compatibility mode
sv: SQL-kompatibilitetsläge

source: Return options
sv: Return alternativ

source: The number of streams that are open (used mainly for logging).
sv: Antalet strömmar som är öppna (används huvudsakligen för loggning).

source: Enable advanced features in configuration file (<code>config.inc.php</code>), for example by starting from <code>config.sample.inc.php</code>.
sv: Aktivera avancerade funktioner i konfigurationsfilen (<code>config.inc.php</code>), till exempel genom att starta från <code>config.sample.inc.php</code>.

source: Ascending
sv: Stigande

source: There was an error importing the ESRI shape file: "%s".
sv: Det uppstod ett fel vid importen av ESRI Shape-filen: "%s".

source: Hide databases
sv: Dölj databaser

source: User groups table
sv: Användargruppstabell

source: There are no recent tables.
sv: Det finns inga nya tabeller.

source: Maximum number of characters shown in any non-numeric column on browse view.
sv: Maximalt antal tecken som visas i icke-numeriska kolumner i bläddringsvyn.

source: Description
sv: Beskrivning

source: PARTITION definition:
sv: Partitionsdefinition:

source: Click to sort results by this column.
sv: Klicka på sortera efter den här kolumnen.

source: Start auto refresh
sv: Starta automatisk uppdatering

source: Rate of aborted clients
sv: Andelen avslutade klienter

source: User accounts
sv: Användarkonton

source: Reset
sv: Återställ

source: Mar
sv: mars

source: No bookmarks
sv: Inga bokmärken

source: zipped
sv: zippad

source: Export tables as separate files
sv: Exportera tabeller som separata filer

source: Do you really want to delete the search "%s"?
sv: Vill du verkligen ta bort sökningen "%s"?

source: Natural order
sv: Naturlig ordning

source: key
sv: nyckel

source: KiB
sv: kB

source: Create table
sv: Skapa tabell

source: Apply
sv: Verkställ

source: Profiling
sv: Profilering

source: Import from browser's storage
sv: Importera från webbläsaren

source: The number of pages currently dirty.
sv: Antalet sidor för närvarande orena.

source: Repeat the headers every X cells, [kbd]0[/kbd] deactivates this feature.
sv: Upprepa rubrik varje X celler, [kbd]0[/kbd] avaktiverar den här funktionen.

source: Version information:
sv: Versionsinformation:

source: Select database first
sv: Markera databasen först

source: Show hidden messages
sv: Visa dolda meddelanden

source: A 1-byte integer, signed range is -128 to 127, unsigned range is 0 to 255
sv: En 1-byte heltal, signerat intervall är -128 till 127, osignerad intervall är 0 till 255

source: Allow third party framing
sv: Tillåt tredjeparts infogning

source: Show events in tree
sv: Visa händelser som träd

source: SQL Query Console
sv: SQL-frågeruta

source: Export the structure of all tables.
sv: Exportera strukturen för alla tabeller.

source: Similar to the VARCHAR type, but stores binary byte strings rather than non-binary character strings
sv: Liknande typen VARCHAR, men lagrar binära bytesträngar snarare än icke-binära teckensträngar

source: Default sort order for tables with a primary key.
sv: Standardsorteringsordning för tabeller med en primär nyckel.

source: @SERVER@ will become the server name.
sv: @SERVER@ blir servernamnet.

source: SQL query:
sv: SQL-fråga:

source: Cyrillic
sv: Kyrillisk

source: View:
sv: Vy:

source: Rename to
sv: Byt namn till

source: Maximum execution time
sv: Maximal exekveringstid

source: Quick - display only the minimal options to configure
sv: Snabb - visa endast få alternativ för konfiguration

source: Index %s has been dropped.
sv: Index %s har tagits bort.

source: The amount of memory allocated to the transaction log cache used to cache on transaction log data. The default is 16MB.
sv: Mängden minne som allokeras för transaktionsloggcachen som används för cache av transaktionsloggdata. Standardvärdet är 16MB.

source: Baltic
sv: Baltisk

source: In order to put the original table '%1$s' into Third normal form we need to create the following tables:
sv: För att ändra den ursprungliga tabellen '%1$s' till tredje normalformen måste vi skapa följande tabeller:

source: Connections are usually aborted when they cannot be authorized. <a href="https://www.percona.com/blog/2008/08/23/how-to-track-down-the-source-of-aborted_connects/">This article</a> might help you track down the source.
sv: Anslutningar avbryts vanligtvis när de inte kan auktoriseras. <a href="https://www.percona.com/blog/2008/08/23/how-to-track-down-the-source-of-aborted_connects/"> denna artikel</a> kan hjälpa dig att spåra källan.

source: Please enter a valid database name.
sv: Vänligen ange ett giltigt databasnamn.

source: Grant all privileges on wildcard name (username\_%).
sv: Bevilja alla privilegier till namn med jokertecken (username\_%).

source: The number of items that can be displayed on each page on the first level of the navigation tree.
sv: Antalet objekt som kan visas på varje sida på den första nivån av navigationsträdet.

source: Login cookie store is lower than cookie validity configured in phpMyAdmin, because of this, your login will expire sooner than configured in phpMyAdmin.
sv: Login-cookie lagras kortare tid än giltighetstiden som är konfigurerad i phpMyAdmin, på grund av detta kommer dina inloggningsuppgifter upphöra att gälla tidigare än konfigurerats i phpMyAdmin.

source: Send error report
sv: Skicka felrapport

source: Extra options
sv: Extra alternativ

source: Database
sv: Databas

source: You haven't saved the changes in the layout. They will be lost if you don't save them. Do you want to continue?
sv: Du har inte sparat ändringarna i layouten. Dessa kommer förloras om du inte sparar dem. Vill du fortsätta?

source: Recent
sv: Senaste

source: Script timeout passed, if you want to finish import, please %sresubmit the same file%s and import will resume.
sv: Timeout för skript passerade, om du vill avsluta import, vänligen %sresubmit samma fil%s och import kommer att återupptas.

source: The amount of data read so far, in bytes.
sv: Mängden data läst hittills, i bytes.

source: Strength:
sv: Styrka:

source: Reloading the privileges
sv: Laddar om privilegierna

source: Enter executes queries in console
sv: Ange sökningar i konsolen

source: Static analysis:
sv: Statisk analys:

source: Bulgarian
sv: Bulgarisk

source: Restricts the MySQL servers the user can enter when a login to an arbitrary MySQL server is enabled by matching the IP or hostname of the MySQL server to the given regular expression.
sv: Begränsar de MySQL-servrar användaren kan ange när en inloggning till en godtycklig MySQL-server aktiveras genom att matcha IP- eller värdnamnet för MySQL-servern till det givna reguljära uttrycket.

source: Options
sv: Alternativ

source: Do you really want to reset the replica (RESET REPLICA)?
sv: Vill du verkligen återställa repliken (RESET REPLICA)?

source: %d object(s) created.
sv: %d objekt skapade.

source: The definer must be in the "username@hostname" format!
sv: Definieraren måste vara i formatet: "användarnamn@hostname"!

source: You must provide a valid return type for the routine.
sv: Du måste ange en giltig returtyp för händelsen.

source: Functions:
sv: Funktioner:

source: , latest stable version:
sv: , senaste stabila version:

source: Storage Engine:
sv: Lagringsmotor:

source: You must provide a valid timing for the trigger!
sv: Du måste ange en giltig tidsgräns för triggern!

source: You must provide length/values for routine parameters of type ENUM, SET, VARCHAR and VARBINARY.
sv: Du måste ange längd/värden för rutinparametrar av typen ENUM, SET, VARCHAR och VARBINARY.

source: Export table headers
sv: Exportera tabellhuvuden

source: Save on server
sv: Spara på server

source: Automatically create versions
sv: Skapa versioner automatiskt

source: Arabic
sv: Arabisk

source: Display GIS Visualization
sv: Visa GIS-visualisering

source: Save changes
sv: Spara ändringar

source: Label key:
sv: Märk nyckeln:

source: If enabled, phpMyAdmin continues computing multiple-statement queries even if one of the queries failed.
sv: Om aktiverat fortsätter phpMyAdmin att utföra fleruttrycksfrågor även om en av frågorna misslyckades.

source: Or alternately go to 'Operations' tab of any database to set it up there.
sv: Eller alternativt gå till "Drift" fliken i någon databas till sätta den upp där.

source: Garbage threshold
sv: Gräns för skräp

source: %s days, %s hours, %s minutes and %s seconds
sv: %s dagar, %s timmar, %s minuter och %s sekunder

source: Purpose:
sv: Syfte:

source: Show query history at start
sv: Visa sökhistorik vid start

source: Error when evaluating: %s
sv: Fel vid utvärdering: %s

source: Server level tabs
sv: Flikar på servernivå

source: %d total
sv: %d totalt

source: Protocol version:
sv: Protokollversion:

source: The number of latched pages in InnoDB buffer pool. These are pages currently being read or written or that can't be flushed or removed for some other reason.
sv: Antalet låsta sidor i InnoDB-buffert. Dessa är sidor som för närvarande läses eller skrivs eller som inte kan rensas eller tas bort av någon annan anledning.

source: The current number of pending writes.
sv: Nuvarande antal väntande skrivningar.

source: Privileges for %s
sv: Privilegier för %s

source: Syntax to use when inserting data:
sv: Syntax att använda när data infogas:

source: Add statements:
sv: Lägg till uppgift:

source: slow_query_log is enabled, but the server logs only queries that take longer than %d seconds. It is advisable to set this long_query_time 0-2 seconds, depending on your system.
sv: slow_query_log är aktiverad, men servern loggar endast frågor som tar längre tid än %d sekunder. Det är lämpligt att definiera long_query_time till 0-2 sekunder, beroende på ditt system.

source: The MySQL server can ask the NDB Cluster storage engine if it knows about a table with a given name. This is called discovery. Handler_discover indicates the number of time tables have been discovered.
sv: MySQL-servern kan fråga lagringsmotorn NDB Cluster om den känner till en tabell med ett givet namn. Detta kallas upptäckt. Handler_discover indikerar antalet gånger tabeller har upptäckts.

source: You may need to decrease the size of {key_buffer_size}, re-examine your tables to see if indexes have been removed, or examine queries and expectations about what indexes are being used.
sv: Du kan behöva minska storleken på {key_buffer_size}, se över dina tabeller för att se om index har tagits bort eller kontrollera frågor och förväntningar på vilka index som används.

source: Always expand query messages
sv: Expandera alltid frågemeddelanden

source: Set log_output to %s
sv: Sätt log_output till %s

source: Showing SQL query
sv: Visar SQL-fråga

source: FOREIGN KEY relationship has been removed.
sv: Främmande nyckel-relation har tagits bort.

source: Create the following table
sv: Skapa följande tabell

source: Delete page
sv: Radera sida

source: Validates the string using regular expression and performs insert only if string matches it. The first option is the Regular Expression.
sv: Validerar strängen med hjälp av reguljära uttryck och infoga endast om strängen matchar det. Det första alternativet är det reguljära uttrycket.

source: Retry to connect
sv: Försök ansluta igen

source: Table %s has been flushed.
sv: Tabellen %s har rensats.

source: Use the NULL value for this column.
sv: Använd värdet NULL för den här kolumnen.

source: Drag to reorder.
sv: Dra för att ändra ordning.

source: Run SQL query/queries on database %s
sv: Kör SQL-fråga/frågor i databasen %s

source: Maximum size for input field
sv: Maximal storlek för inmatningsfält

source: User preferences:
sv: Användarinställningar:

source: Remove columns from central list
sv: Ta bort kolumner från huvudlista

source: Saving export templates:
sv: Sparande av exportmallar:

source: Failed security key activation.
sv: Aktivering av säkerhetsnyckeln misslyckades.

source: Percentage of sorts that cause temporary tables
sv: Andelen av sorteringar som medför temporära tabeller

source: The FIDO U2F API has been deprecated in favor of the Web Authentication API (WebAuthn).
sv: FIDO U2F-API:t har fasats ut till förmån för Web Authentication API (WebAuthn).

source: Import percentages as proper decimals <i>(ex. 12.00% to .12)</i>
sv: Importera procenttal som vanliga decimaltal <i>(t.ex. 12.00% blir .12)</i>

source: Table name
sv: Tabellnamn

source: Add user group
sv: Lägg till användargrupp

source: YES
sv: JA

source: Whether a warning ("Are your really sure…") should be displayed when you're about to lose data.
sv: Anger om en varning ("Är du riktigt säker…") ska visas när du håller på att förlora data.

source: Control user password
sv: Lösenord för kontrollanvändare

source: No data
sv: Inget data

source: Overhead
sv: Outnyttjat

source: This view has at least this number of rows. Please refer to %sdocumentation%s.
sv: Denna vy har åtminstone detta antal rader. Se %sdokumentationen%s.

source: criteria
sv: kriterier

source: Index name:
sv: Indexnamn:

source: Show only active
sv: Visa endast aktiva

source: Table %s has been moved to %s. Privileges have been adjusted.
sv: Registret %s har flyttats till %s., privilegier har justerats.

source: Indexes for table
sv: Index för tabell

source: User for config auth
sv: Användare för config auth

source: You are using Git version, run [kbd]git pull[/kbd] :-)[br]The latest stable version is %s, released on %s.
sv: Du använder Git-versionen, kör [kbd]git pull[/kbd] :-) [br] Den senaste stabila versionen är %s, släppt den %s.

source: Two-factor authentication is not available, enable phpMyAdmin configuration storage to use it.
sv: Tvåfaktorsautentisering är inte tillgänglig. Aktivera phpMyAdmins konfigurationslagring för att använda den.

source: Could not remove columns!
sv: Kunde inte ta bort kolumner!

source: Optimize table
sv: Optimera tabell

source: No parameters found!
sv: Inga parametrar funna!

source: Node group
sv: Nodgrupp

source: Foreign key dropdown order
sv: Ordning i främmande nyckel-listruta

source: Questions below 1,000
sv: Frågor mindre än 1000

source: Exporting a raw query
sv: Exporterar en rå fråga

source: Point %d:
sv: Punkt %d:

source: Table:
sv: Tabell:

source: log_output is set to TABLE.
sv: log_output är definerad som TABLE.

source: Confirm partial dependencies
sv: Bekräfta partiellt beroenden

source: + Add constraint
sv: + Lägg till villkor

source: Jump to database “%s”.
sv: Hoppa till databasen ”%s”.

source: History
sv: Historik

source: Pause monitor
sv: Pausa övervakning

source: Maximum number of characters used when a SQL query is displayed.
sv: Maximalt antal tecken som används när en SQL-fråga visas.

source: Updated
sv: Uppdaterad

source: No password
sv: Inget lösenord

source: Response parameter for reCAPTCHA v2 API
sv: Svarsparameter för reCAPTCHA v2-API

source: X Values
sv: X-värden

source: Allows creating stored routines.
sv: Tillåter skapande av lagrade rutiner.

source: Deleting %s
sv: Tar bort %s

source: SCHEMA ERROR:
sv: SCHEMAFEL:

source: … keep the old one.
sv: … behåll den gamla.

source: User
sv: Användare

source: Any user
sv: Vilken användare som helst

source: Because of its length,<br> this column might not be editable.
sv: På grund av sin längd,<br> är denna kolumn kanske inte redigerbar.

source: Use user-friendly editor for editing SQL queries (CodeMirror) with syntax highlighting and line numbers.
sv: Använd användarvänlig editor för att redigera SQL-frågor (CodeMirror) med syntaxmarkering och radnummer.

source: Object creation options (all are recommended)
sv: Alternativ vid skapande av objekt (alla rekommenderas)

source: Port on which MySQL server is listening, leave empty for default.
sv: Port som MySQL-servern lyssnar på, lämna blankt för standardport.

source: include column names in every <code>INSERT</code> statement <br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3)</code>
sv: inkludera kolumnnamn i varje <code>INSERT</code>-kommando <br> &nbsp; &nbsp; &nbsp; Exempel: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3)</code>

source: Relational schema
sv: Relationsschema

source: You may want to refresh the page.
sv: Du kan vilja ladda om sidan.

source: User has been added.
sv: En användare har skapats.

source: Got invalid version string from server
sv: Ogiltig versionssträng från servern

source: Query cache max size
sv: Maximal storlek för frågecache

source: Number of rows:
sv: Antal rader:

source: The account %s@%s has been successfully locked.
sv: Kontot %s@%s har låsts.

source: Internal relationships were successfully updated.
sv: Interna relationer har uppdaterats.

source: Check the columns which form a repeating group. If no such group, click on 'No repeating group'
sv: Markera kolumnerna som utgör en upprepande grupp. Om ingen sådan grupp, klickar du på "Inget upprepande grupp"

source: Control port
sv: Kontrollport

source: Gives access to the complete list of databases.
sv: Ger tillgång till den fullständiga databaslistan.

source: Compression:
sv: Komprimering:
